; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-7)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	city0 - city
	city1 - city
	city2 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 7004)
	(= (fuel plane1) 2517)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 7)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 5)
	(at plane2 city0)
	(= (capacity plane2) 7366)
	(= (fuel plane2) 168)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 6)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 4)
	(at plane3 city1)
	(= (capacity plane3) 5921)
	(= (fuel plane3) 738)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 5)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 2)
	(at plane4 city2)
	(= (capacity plane4) 8650)
	(= (fuel plane4) 2743)
	(= (slow-burn plane4) 3)
	(= (fast-burn plane4) 8)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 2)
	(at plane5 city0)
	(= (capacity plane5) 10531)
	(= (fuel plane5) 2393)
	(= (slow-burn plane5) 5)
	(= (fast-burn plane5) 18)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 7)
	(at person1 city2)
	(at person2 city2)
	(at person3 city0)
	(at person4 city2)
	(at person5 city2)
	(at person6 city2)
	(at person7 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 899)
	(= (distance city0 city2) 500)
	(= (distance city1 city0) 899)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 750)
	(= (distance city2 city0) 500)
	(= (distance city2 city1) 750)
	(= (distance city2 city2) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city0)
	(at plane4 city2)
	(at plane5 city0)
	(at person1 city2)
	(at person2 city0)
	(at person3 city0)
	(at person4 city2)
	(at person5 city2)
	(at person6 city0)
	(at person7 city0)
	))

(:metric minimize (+ (* 1 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (board person2 plane4 city2)
   deleted: (at person2 city2)
   added: (in person2 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 8 of 10
2. (board person6 plane4 city2)
   deleted: (at person6 city2)
   added: (in person6 plane4)
   changed: (onboard plane4) from 1 to 2
   goals met: 8 of 10
3. (fly plane4 city2 city0)
   deleted: (at plane4 city2)
   added: (at plane4 city0)
   changed: (total-fuel-used) from 0 to 1500, (fuel plane4) from 2743 to 1243
   goals met: 7 of 10
4. (debark person2 plane4 city0)
   deleted: (in person2 plane4)
   added: (at person2 city0)
   changed: (onboard plane4) from 2 to 1
   goals met: 8 of 10
5. (debark person6 plane4 city0)
   deleted: (in person6 plane4)
   added: (at person6 city0)
   changed: (onboard plane4) from 1 to 0
   goals met: 9 of 10
6. (refuel plane4 city0)
   changed: (fuel plane4) from 1243 to 8650
   goals met: 9 of 10
7. (fly plane4 city0 city2)
   deleted: (at plane4 city0)
   added: (at plane4 city2)
   changed: (total-fuel-used) from 1500 to 3000, (fuel plane4) from 8650 to 7150
   goals met: 10 of 10
